eamars/efr32_bootloader/target/efr32/protocol/thread_2.2/app/thread/sample-app/border-router/sensor-actuator-node/sensor-actuator-node-implementation.c
// Copyright 2016 Silicon Laboratories, Inc.

#include PLATFORM_HEADER
#include CONFIGURATION_HEADER
#include EMBER_AF_API_STACK
#include EMBER_AF_API_HAL
#include EMBER_AF_API_BUTTON_PRESS
#include EMBER_AF_API_COMMAND_INTERPRETER2
#include EMBER_AF_API_NETWORK_MANAGEMENT
#ifdef EMBER_AF_API_DEBUG_PRINT
  #include EMBER_AF_API_DEBUG_PRINT
#endif
#include EMBER_AF_API_TFTP
#include EMBER_AF_API_TFTP_BOOTLOADER

#if defined(CORTEXM3_EFM32_MICRO)
#include "em_adc.h"
#include "em_cmu.h"
#if defined(EMBER_AF_PLUGIN_GLIB)
#include "spidrv.h"
#include "displaypalconfig.h"
#include EMBER_AF_API_GLIB
#endif //EMBER_AF_PLUGIN_GLIB
#endif //CORTEXM3_EFM32_MICRO

#define ALIAS(x) x##Alias
#include "app/thread/plugin/udp-debug/udp-debug.c"
#include "plugin/serial/serial.h"
#include <stdio.h>

// This definition is used when a Thread network should be joined out of band.
// If ENABLE_JOIN_OUT_OF_BAND is defined a precommissioned network will be used
// instead of commissioning. Use this feature with a border-router application
// that also has this defined and uses the same settings specified below.
// Uncomment the ENABLE_JOIN_OUT_OF_BAND to use the official commissioning app
#define ENABLE_JOIN_OUT_OF_BAND
#if defined(ENABLE_JOIN_OUT_OF_BAND)
#define OOB_PREFERRED_CHANNEL 19
#define OOB_FALLBACK_CHANNEL_MASK 0 // All channels
#define OOB_PAN_ID 0x1075
#define OOB_EXTENDED_PAN_ID { 0xc6, 0xef, 0xe1, 0xb4, 0x5f, 0xc7, 0x8e, 0x4f }
#define OOB_KEY_SEQUENCE 0
#define OOB_FIXED_JOIN_KEY "ABCD1234"
#define OOB_ULA_PREFIX {0xfd, 0x01, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00}
#endif

// WARNING: This sample application generates a human-readable (i.e., ASCII)
// join key based on a simple hash of the EUI64 of the node if
// USE_EUI64_AS_JOIN_KEY is defined.  If it is not defined it will use the
// FIXED_JOIN_KEY.  These methods are used because it provides a predictable
// yet reasonably unique key suitable for a development kit node.  Real devices
// MUST NOT use join keys that are based on the EUI64 or predefined.  Random
// join keys MUST be used for real devices, with the keys typically programmed
// during product manufacturing and printed on the devices themselves for access
// by the user.
//
#define USE_EUI64_AS_JOIN_KEY 1
#define FIXED_JOIN_KEY "ABCD1234"

// This represents how many times the device will attempt to join until it
// stops scanning and waits for another button press to trigger a join
#define SENSOR_ACTUATOR_JOIN_ATTEMPTS 2

// LCD UI macros
#define EUI_ROW 5
#define JOIN_KEY_ROW 15
#define NODE_TYPE_ROW 35
#define NETWORK_ID_ROW 45
#define PAN_ID_ROW 55
#define CHANNEL_ROW 65
#define IP_ADDRESS_INITIAL_ROW 75

#define ROW_SIZE 10
#define START_COLUMN 5
#define LCD_ASCII_SCREEN_WIDTH 20

#define PADDED_ASCII_BUFFER_SIZE 32
#define IP_ADDRESS_CHAR_TRIM 9

#define LCD_OPAQUE_VALUE 0
#define LCD_REFRESH_MS 200

// Start off with join attempts remaining to 0, to have this scan on startup
// set this to SENSOR_ACTUATOR_JOIN_ATTEMPTS
#if !defined(ENABLE_JOIN_OUT_OF_BAND)
static uint8_t joinAttemptsRemaining = 0; 
#endif

// Every IDLE_PERIOD_TIMEOUT_MS the key is printed to the console
#define IDLE_PERIOD_TIMEOUT_MS (60 * MILLISECOND_TICKS_PER_SECOND)

#define NETWORK_STATUS_STRING(status) \
  (status == EMBER_NO_NETWORK ? "NO NETWORK": \
  (status == EMBER_SAVED_NETWORK ? "SAVED NETWORK" : \
  (status == EMBER_JOINING_NETWORK ? "JOINING NETWORK" : \
  (status == EMBER_JOINED_NETWORK_ATTACHING ? "JOINED ATTACHING" : \
  (status == EMBER_JOINED_NETWORK_ATTACHED ? "JOINED ATTACHED" : \
  (status == EMBER_JOINED_NETWORK_NO_PARENT ? "JOINED NO PARENT" : \
  "ERROR"))))))


// some helpers for parsing JSON payloads from a subscriber
#define IP_JSON_KEY "\"ip\":\""
#define PORT_JSON_KEY "\"port\":"

static void resumeNetwork(void);
static void getJoinKey(uint8_t *joinKey, uint8_t *joinKeyLength);
#if defined(ENABLE_JOIN_OUT_OF_BAND)
#define joinNetwork joinNetworkCommissioned
static void joinNetworkCommissioned(void);
#else
static void joinNetwork(void);
#endif
static void announceToAddress(const EmberIpv6Address *newBorderRouter);
static void finishAnnounceToAddress(void);
static void waitForSubscriptions(void);
static void startReportingTemperature(const EmberIpv6Address *newSubscriberAddress,
                                      const uint16_t newSubscriberPort);
static void reportTemperature(void);
static void stopReportingTemperature(void);
static void resetNetworkState(void);
static void rejoinNetwork(void);

// These functions will be used when the WSTK is used as the platform to
// populate the LCD with useful information
#if defined(EMBER_AF_PLUGIN_GLIB) && defined(CORTEXM3_EFM32_MICRO)
static char* nodeTypeToString(EmberNodeType nodeType);
static void lcdPrintNetworkStatus(EmberNetworkStatus status, uint8_t printRow);
static void lcdPrintJoinCode(uint8_t *joinKey, uint8_t printRow);
static void lcdPrintIpv6Address(const EmberIpv6Address *address,
                                uint8_t printRow,
                                uint8_t screenWidth);
static void lcdPrintCurrentDeviceState(void);
#endif //EMBER_AF_PLUGIN_GLIB

static void reportTemperatureStatusHandler(EmberCoapStatus status,
                                           EmberCoapCode code,
                                           EmberCoapReadOptions *options,
                                           uint8_t *payload,
                                           uint16_t payloadLength,
                                           EmberCoapResponseInfo *info);

static void buttonPressStatusHandler(EmberCoapStatus status,
                                     EmberCoapCode code,
                                     EmberCoapReadOptions *options,
                                     uint8_t *payload,
                                     uint16_t payloadLength,
                                     EmberCoapResponseInfo *info);

static EmberIpv6Address globalAddress;
static uint8_t globalAddressString[EMBER_IPV6_ADDRESS_STRING_SIZE] = {0};
static EmberIpv6Address discoverRequestAddress = {0};
static EmberIpv6Address subscriberAddress = {0};
static uint16_t subscriberPort = EMBER_COAP_PORT;
static uint8_t joinKey[EMBER_JOIN_KEY_MAX_SIZE + 1] = {0};
static uint8_t joinKeyLength = 0;

static const EmberIpv6Address allMeshRouters = {
  {0xFF, 0x03, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
   0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x02,}
};

