eamars/efr32_bootloader/target/efr32/protocol/thread_2.2/app/thread/sample-app/border-router/sensor-actuator-node/sensor-actuator-node-implementation.c
static uint8_t failedReports;
#define REPORT_FAILURE_LIMIT 3
#define WAIT_PERIOD_MS   (30 * MILLISECOND_TICKS_PER_SECOND)
#define REPORT_PERIOD_MS (10 * MILLISECOND_TICKS_PER_SECOND)

static const uint8_t deviceAnnounceUri[] = "device/announce";
static const uint8_t temperatureUri[] = "device/temperature";
static const uint8_t buttonUri[] = "device/button";

#if defined(ENABLE_JOIN_OUT_OF_BAND)
// WARNING: This compile option uses a fixed join key that is global to the
// entire Thread network.  This method is used because it provides a predictable
// key suitable for a development kit node. Real devices MUST NOT use join keys
// that are fixed. Random join keys MUST be used for real devices, with the keys
// typically programmed during product manufacturing and printed on the devices
// themselves for access by the user.

// The network name is not communicated to the the end node when in
// pre-comissioned mode (also called join out-of-band mode) and the network name
// is defaulted to "precommissioned". The network name is communicated to the
// end node when in commissioning mode and default name "precommissioned" is
// updated with the network name.
static const uint8_t networkId[EMBER_NETWORK_ID_SIZE] = "precommissioned";
static const uint8_t preferredChannel = OOB_PREFERRED_CHANNEL;
static const uint32_t fallbackChannelMask = OOB_FALLBACK_CHANNEL_MASK;
static const uint16_t panId = OOB_PAN_ID;
static const uint8_t ulaPrefix[] = OOB_ULA_PREFIX;
static const uint8_t extendedPanId[] = OOB_EXTENDED_PAN_ID;
static const uint32_t keySequence = OOB_KEY_SEQUENCE;

// WARNING: This compile option uses the well-know sensor/sink network key as 
// the master key.  This is done for demonstration purposes, so that packets
// decrypt automatically in Ember Desktop.  Using predefined keys keys is a 
// significant security risk.  Real devices MUST NOT used fixed keys and 
// MUST use random keys instead.  The stack automatically generates random
// keys if emberSetSecurityParameters is not called prior to forming.
//#define USE_RANDOM_MASTER_KEY
static const EmberKeyData masterKey = {
  {0x65, 0x6D, 0x62, 0x65, 0x72, 0x20, 0x45, 0x4D,
   0x32, 0x35, 0x30, 0x20, 0x63, 0x68, 0x69, 0x70,}
};
#endif 


enum {
  INITIAL                              = 0,
  RESUME_NETWORK                       = 1,
  JOIN_NETWORK                         = 2,
  WAIT_FOR_JOIN_NETWORK                = 3,
  WAIT_FOR_SUBSCRIPTIONS               = 4,
  REPORT_TEMP_TO_SUBSCRIBER            = 5,
  WAIT_FOR_DATA_CONFIRMATION           = 6,
  JOINED_TO_NETWORK                    = 7,
  RESET_NETWORK_STATE                  = 8,
};

#define STATE_STRING(state) \
  (state == INITIAL ? "INITIAL": \
  (state == RESUME_NETWORK ? "RESUME_NETWORK": \
  (state == JOIN_NETWORK ? "JOIN_NETWORK": \
  (state == WAIT_FOR_JOIN_NETWORK ? "WAIT_FOR_JOIN_NETWORK": \
  (state == WAIT_FOR_SUBSCRIPTIONS ? "WAIT_FOR_SUBSCRIPTIONS": \
  (state == REPORT_TEMP_TO_SUBSCRIBER ? "REPORT_TEMP_TO_SUBSCRIBER": \
  (state == WAIT_FOR_DATA_CONFIRMATION ? "WAIT_FOR_DATA_CONFIRMATION": \
  (state == JOINED_TO_NETWORK ? "JOINED_TO_NETWORK": \
  (state == RESET_NETWORK_STATE ? "RESET_NETWORK_STATE": \
  "ERROR")))))))))

static uint8_t state = INITIAL;
EmberEventControl stateEventControl;
EmberEventControl updateDisplayEventControl;

static void setNextStateWithDelay(uint8_t nextState, uint32_t delayMs);
#define setNextState(nextState)       setNextStateWithDelay((nextState), 0)
#define repeatState()                 setNextStateWithDelay(state, 0)
#define repeatStateWithDelay(delayMs) setNextStateWithDelay(state, (delayMs))

// Keep our EUI string for JSON payloads, take size in bytes x2 to account for
// ASCII and add 1 for a NULL terminator
static uint8_t euiString[EUI64_SIZE * 2 + 1] = {0};

// String helper function prototypes
static void formatEuiString(uint8_t* euiString, size_t strSz, const uint8_t* euiBytes);
static const uint8_t *printableNetworkId(void);

#if defined(CORTEXM3_EFM32_MICRO)
static void adcSetup(void);
static int32_t convertToCelsius(int32_t adcSample);
static uint32_t adcRead(void);

// @brief Initialize ADC for temperature sensor readings in single join
static void adcSetup(void)
{
  // Enable ADC clock 
  CMU_ClockEnable(cmuClock_ADC0, true);

  // Base the ADC configuration on the default setup. 
  ADC_Init_TypeDef       init  = ADC_INIT_DEFAULT;
  ADC_InitSingle_TypeDef sInit = ADC_INITSINGLE_DEFAULT;

  // Initialize timebases 
  init.timebase = ADC_TimebaseCalc(0);
  init.prescale = ADC_PrescaleCalc(400000, 0);
  ADC_Init(ADC0, &init);

  // Set input to temperature sensor. Reference must be 1.25V 
  sInit.reference   = adcRef1V25;
  sInit.acqTime     = adcAcqTime8; // Minimum time for temperature sensor 
  sInit.posSel      = adcPosSelTEMP;
  ADC_InitSingle(ADC0, &sInit);
}

// @brief  Do one ADC conversion
// @return ADC conversion result
static uint32_t adcRead(void)
{
  ADC_Start(ADC0, adcStartSingle);
  while ((ADC0->STATUS & ADC_STATUS_SINGLEDV) == 0) {
    // Busy wait
  }
  return ADC_DataSingleGet(ADC0);
}

// @brief Convert ADC sample values to celsius.
// @detail See section 25.3.4.1 in the reference manual for detail
//   on temperature measurement and conversion.
// @param adcSample Raw value from ADC to be converted to celsius
// @return The temperature in milli degrees celsius.
static int32_t convertToCelsius(int32_t adcSample)
{
  uint32_t calTemp0;
  uint32_t calValue0;
  int32_t readDiff;
  float temp;

  // Factory calibration temperature from device information page.
  calTemp0 = ((DEVINFO->CAL & _DEVINFO_CAL_TEMP_MASK)
              >> _DEVINFO_CAL_TEMP_SHIFT);

  calValue0 = ((DEVINFO->ADC0CAL3
                // _DEVINFO_ADC0CAL3_TEMPREAD1V25_MASK is not correct in
                //    current CMSIS. This is a 12-bit value, not 16-bit.
                & 0xFFF0)
               >> _DEVINFO_ADC0CAL3_TEMPREAD1V25_SHIFT);

  if ((calTemp0 == 0xFF) || (calValue0) == 0xFFF) {
    // The temperature sensor is not calibrated 
    return -100.0;
  }

  // Vref = 1250mV
  // TGRAD_ADCTH = 1.835 mV/degC (from datasheet)

  readDiff = calValue0 - adcSample;
  temp     = ((float)readDiff * 1250);
  temp    /= (4096 * -1.835);

  // Calculate offset from calibration temperature 
  temp     = (float)calTemp0 - temp;
  return (uint32_t)(temp * 1000);
}
#else
static void adcSetup(void)
{
  // No setup needed for non EFR devices
}
#endif //CORTEXM3_EFM32_MICRO

