eamars/efr32_bootloader/target/efr32/protocol/thread_2.2/app/thread/sample-app/border-router/sensor-actuator-node/sensor-actuator-node-implementation.c
void emberAfInitCallback(void)
{
  // This callback is called after the stack has been initialized.  It is our
  // opportunity to do initialization, like resuming the network or joining a
  // new network.

  // Get and store EUI since we need it around for JSON strings
  formatEuiString(euiString, sizeof(euiString), emberEui64()->bytes);
  emberAfCorePrintln("Eui64: >%s", euiString);

  // joinKey does not change during operation and can be called during init
  getJoinKey(joinKey, &joinKeyLength);

  // Set up the ADC for temperature conversions
  adcSetup();

  // Set Led to on by default
  halSetLed(BOARD_ACTIVITY_LED);

#if defined(EMBER_AF_PLUGIN_GLIB) && defined(CORTEXM3_EFM32_MICRO)
  // If it is present, initialize the graphics display
  GRAPHICS_Init();
  glibContext.backgroundColor = White;
  glibContext.foregroundColor = Black;
  GLIB_clear(&glibContext);
#endif //EMBER_AF_PLUGIN_GLIB
}

void emberAfNetworkStatusCallback(EmberNetworkStatus newNetworkStatus,
                                  EmberNetworkStatus oldNetworkStatus,
                                  EmberJoinFailureReason reason)
{
  // This callback is called whenever the network status changes, like when
  // we finish joining to a network or when we lose connectivity.  If we have
  // no network, we try joining to one as long as join attempts remain.  Join
  // attempts are reset whenever button 1 is pressed.  If we have a saved
  // network, we try to resume operations on that network.  When we are joined
  // and attached to the network, we wait for an advertisement and then begin 
  // reporting.

  emberEventControlSetInactive(stateEventControl);
  emberEventControlSetActive(updateDisplayEventControl);

  switch (newNetworkStatus) {
  case EMBER_NO_NETWORK:
    if (oldNetworkStatus == EMBER_JOINING_NETWORK) {
      emberAfCorePrintln("ERR: Joining failed: 0x%x", reason);
    }
    setNextState(JOIN_NETWORK);
    break;
  case EMBER_SAVED_NETWORK:
    setNextState(RESUME_NETWORK);
    break;
  case EMBER_JOINING_NETWORK:
    // Wait for either the "attaching" or "no network" state.
    break;
  case EMBER_JOINED_NETWORK_ATTACHING:
    // Wait for the "attached" state.
    break;
  case EMBER_JOINED_NETWORK_ATTACHED:
    emberAfCorePrintln("%s network \"%s\"",
                       (state == RESUME_NETWORK
                        ? "Resumed operation on"
                        : (state == JOIN_NETWORK
                           ? "Joined"
                           : "Rejoined")),
                       printableNetworkId());

#if !defined(ENABLE_JOIN_OUT_OF_BAND)
    joinAttemptsRemaining = 0;
#endif

    setNextState(WAIT_FOR_SUBSCRIPTIONS);
    break;
  case EMBER_JOINED_NETWORK_NO_PARENT:
    // We always join as a router, so we should never end up in the "no parent"
    // state.
    assert(false);
    break;
  default:
    assert(false);
    break;
  }
}

static void resumeNetwork(void)
{
  assert(state == RESUME_NETWORK);

  emberAfCorePrintln("Resuming operation on network \"%s\"", printableNetworkId());

  emberResumeNetwork();
}

void emberResumeNetworkReturn(EmberStatus status)
{
  // This return indicates whether the stack is going to attempt to resume.  If
  // so, the result is reported later as a network status change.  If we cannot
  // even attempt to resume, we just give up and try joining instead.

  assert(state == RESUME_NETWORK);

  if (status != EMBER_SUCCESS) {
    emberAfCorePrintln("ERR: Unable to resume: 0x%x", status);
    setNextState(JOIN_NETWORK);
  }

  emberEventControlSetActive(updateDisplayEventControl);
}

#if defined(ENABLE_JOIN_OUT_OF_BAND)
static void joinNetworkCommissioned(void)
{
  emberAfCorePrintln("Joining network with precommisioned network configuration");
  emberCommissionNetwork(preferredChannel,
                         fallbackChannelMask,
                         networkId,
                         sizeof(networkId),
                         panId,
                         ulaPrefix,
                         extendedPanId,
                         &masterKey,
                         keySequence);
}
#else
static void joinNetwork(void)
{
  // When joining a network, we look for one specifically with our network id.
  // The commissioner must have our join key for this to succeed.

  EmberNetworkParameters parameters = {{0}};

  assert(state == JOIN_NETWORK);

  if (joinAttemptsRemaining > 0) {
     // Decrement the join counter 
     joinAttemptsRemaining--;

     emberAfCorePrintln("Joining network using join passphrase \"%s\", join attempts left = %d",
                        joinKey,
                        joinAttemptsRemaining);

     parameters.nodeType = EMBER_ROUTER;
     parameters.radioTxPower = 3;
     parameters.joinKeyLength = joinKeyLength;
     MEMCOPY(parameters.joinKey, joinKey, parameters.joinKeyLength);

     emberJoinNetwork(&parameters,
                      (EMBER_NODE_TYPE_OPTION
                       | EMBER_TX_POWER_OPTION
                       | EMBER_JOIN_KEY_OPTION),
                      EMBER_ALL_802_15_4_CHANNELS_MASK);
  } else {
    // No join attempts remain 
    emberAfCorePrintln("Device idle, press button 1 or 'rejoin-network' command to start a join for EUI \"%s\" and join passphrase \"%s\"",
                       euiString,
                       joinKey);
    emberSerialWaitSend(APP_SERIAL);
    repeatStateWithDelay(WAIT_PERIOD_MS);
  }
}
#endif //ENABLE_JOIN_OUT_OF_BAND

static void getJoinKey(uint8_t *joinKey, uint8_t *joinKeyLength)
{
#if USE_EUI64_AS_JOIN_KEY
  // Using a join key generated from the EUI64 of the node is a security risk,
  // but is useful for demonstration purposes. See the warning above. This
  // hash generates alphanumeric characters in the ranges 0-9 and A-U. The
  // Thread specification disallows the characters I, O, Q, and Z, for
  // readability. I, O, and Q are therefore remapped to V, W, and X. Z is not
  // generated, so it is not remapped.
  const EmberEui64 *eui64;
  eui64 = emberEui64();
  for (*joinKeyLength = 0; *joinKeyLength < EUI64_SIZE; (*joinKeyLength)++) {
    joinKey[*joinKeyLength] = ((eui64->bytes[*joinKeyLength] & 0x0F)
                               + (eui64->bytes[*joinKeyLength] >> 4));
    joinKey[*joinKeyLength] += (joinKey[*joinKeyLength] < 10 ? '0' : 'A' - 10);
    if (joinKey[*joinKeyLength] == 'I') {
      joinKey[*joinKeyLength] = 'V';
    } else if (joinKey[*joinKeyLength] == 'O') {
      joinKey[*joinKeyLength] = 'W';
    } else if (joinKey[*joinKeyLength] == 'Q') {
      joinKey[*joinKeyLength] = 'X';
    }
  }
#else
  // Using a static join key is a security risk, but is useful for demonstration
  // purposes.  See the warning above.
  char fixedJoinKey[EMBER_JOIN_KEY_MAX_SIZE + 1] = FIXED_JOIN_KEY;
  *joinKeyLength = strlen(fixedJoinKey);
  MEMCOPY(joinKey, fixedJoinKey, *joinKeyLength); 
#endif
  emberEventControlSetActive(updateDisplayEventControl);
}

void emberJoinNetworkReturn(EmberStatus status)
{
  // This return indicates whether the stack is going to attempt to join.  If
  // so, the result is reported later as a network status change.  Otherwise,
  // we just try to join again as long as join attempts remain.

  if (status != EMBER_SUCCESS) {
    emberAfCorePrintln("ERR: Unable to join: 0x%x", status);
    setNextState(JOIN_NETWORK);
  } else {
    setNextState(WAIT_FOR_JOIN_NETWORK);
  }
}

void emberCommissionNetworkReturn(EmberStatus status)
{
  switch (status) {
  case EMBER_SUCCESS:
    setNextState(WAIT_FOR_JOIN_NETWORK);
    break;
  case EMBER_BAD_ARGUMENT:
  case EMBER_INVALID_CALL:
    // Try to join the network again if it fails
    emberAfCorePrintln("Pre-Commission failed status %x, retrying", status);
    setNextState(JOIN_NETWORK);
    break;
  default:
    break;
  }
}

void joinNetworkCommissionedCompletion(void)
{
  emberAfCorePrintln("Completing precommisioned join");
  emberJoinCommissioned(3,            // radio tx power
                        EMBER_ROUTER, // type
                        true);        // require connectivity
}

void borderRouterDiscoveryHandler(EmberCoapCode code,
                                  uint8_t *uri,
                                  EmberCoapReadOptions *options,
                                  const uint8_t *payload,
                                  uint16_t payloadLength,
                                  const EmberCoapRequestInfo *info)
{
  // Announce to the remote address trying to discover
  announceToAddress(&info->remoteAddress);
}

// announce
void announceCommand(void)
{
  // We can force an announce to all mesh routers with an announce command
  announceToAddress(&allMeshRouters);
}

static void announceToAddress(const EmberIpv6Address *address)
{
  // We announce to the requested address in response to a discovery (or a CLI
  // command).
  MEMCOPY(&discoverRequestAddress, address, sizeof(EmberIpv6Address));

  emberAfCorePrint("Announcing to address to: ");
  emberAfCoreDebugExec(emberAfPrintIpv6Address(&discoverRequestAddress));
  emberAfCorePrintln("");

  // Get the global address to return to the border router when attaching
  emberGetGlobalAddresses(NULL, 0); // all prefixes

  // The announcement will finish once the global address is returned
}

void emberGetGlobalAddressReturn(const EmberIpv6Address *address,
                                 uint32_t preferredLifetime,
                                 uint32_t validLifetime,
                                 uint8_t addressFlags)
{
  if (emberIsIpv6UnspecifiedAddress(address)) {
    return;
  }

