eamars/efr32_bootloader/target/efr32/protocol/thread_2.2/app/thread/sample-app/border-router/sensor-actuator-node/sensor-actuator-node-implementation.c
  MEMCOPY(&globalAddress, address, sizeof(EmberIpv6Address));
  emberIpv6AddressToString(&globalAddress,
                           globalAddressString,
                           sizeof(globalAddressString));
  emberAfCorePrintln("Global address assigned %s", globalAddressString);
  finishAnnounceToAddress();

  emberEventControlSetInactive(updateDisplayEventControl);
}

static void finishAnnounceToAddress(void)
{
  EmberStatus status;

  // If we returned and got an IP address, return it otherwise just return
  // the EUI and device type
  // Send this CoAP response to the border router when it tries to discover:
  //     {
  //        "ip":"aaaa:0000:0000:0000:1234:1234:1234:1234",
  //        "eui64":"1234123412341234",
  //        "type":"sensor-actuator-node"
  //     }

  // NULL JSON that is a sensor-actuator-node

  char jsonString[140] =
    "{\"ip\":\"0000:0000:0000:0000:0000:0000:0000:0000\",\"eui64\":\"0000000000000000\",\"type\":\"sensor-actuator-node\"}\0";
  uint8_t strSz = strlen("{\"ip\":\"");
  char euiKey[] = "\",\"eui64\":\"";
  char jsonClose[] = "\",\"type\":\"sensor-actuator-node\"}";

  // If we got a global address put it in the JSON
  strncpy(jsonString + strSz, (char const*)globalAddressString, sizeof(jsonString) - strSz);
  strSz += strlen((char const*)globalAddressString);

  // Put the EUI64 in the JSON
  strncpy(jsonString + strSz, (char const*)euiKey, sizeof(jsonString) - strSz);
  strSz += strlen((char const*)euiKey);
  strncpy(jsonString + strSz, (char const*)euiString, sizeof(jsonString) - strSz);
  strSz += strlen((char const*)euiString);

  strncpy(jsonString + strSz, (char const*)jsonClose, sizeof(jsonString) - strSz);
  strSz += strlen((char const*)jsonClose);

  // Use defaults for everything except the NON.
  EmberCoapSendInfo info = {
    .nonConfirmed = true,
  };
  status = emberCoapPost(&discoverRequestAddress,
                         deviceAnnounceUri,
                         (uint8_t const*)jsonString,
                         strlen(jsonString),
                         NULL, // handler
                         &info);
  if (status != EMBER_SUCCESS) {
    emberAfCorePrintln("ERR: Discovery announcement failed: 0x%x", status);
  }
}

void subscribeHandler(EmberCoapCode code,
                      uint8_t *uri,
                      EmberCoapReadOptions *options,
                      const uint8_t *payload,
                      uint16_t payloadLength,
                      const EmberCoapRequestInfo *info)
{
  EmberCoapCode responseCode;
  EmberIpv6Address addressOfSubscriber = {0};
  const EmberIpv6Address *newSubscriberAddress = &info->remoteAddress;
  int rc = 0;
  char* ipAddressKey;
  char ipAddressValue[64] = {0};
  int ipAddressValueSize = 0;
  char* portKey;
  uint16_t portValue = EMBER_COAP_PORT;

  // Check the payload to see if it wants us to subscribe to a remote address
  if (payload) {
    // Split JSON payload into key + value pairs
    //"{\"ip\":\"0000:0000:0000:0000:0000:0000:0000:0000\",\"port\":\"00000\"}\0";

    // Locate the address of the keys in the payload
    ipAddressKey = strstr((char const*)payload, IP_JSON_KEY);
    if (ipAddressKey != NULL) {
      rc = sscanf(ipAddressKey,
                  "%*[^:]:\"%[^\"]\"%n,",
                  ipAddressValue,
                  &ipAddressValueSize);
      if (rc == 1) { 
        emberAfCorePrintln("Parsed JSON IP Address: \"%s\"", ipAddressValue);

        if (!emberIpv6StringToAddress((const uint8_t *)ipAddressValue,
                                      &addressOfSubscriber) ) {
          emberAfCorePrintln("Failed to read malformed subscriber address: %s",
                             ipAddressValue);
          // newSubscriberAddress is initialized to info->remoteAddress. If
          // payload was malformatted we automatically failover to the source
          // address of the request packet
        } else {
          newSubscriberAddress = &addressOfSubscriber;
        }
      } else {
        // If the address is malformatted, clear our local variable to denote
        // the error
        emberAfCorePrintln("Failed to read malformed IP Address (rc=%d", rc);
        ipAddressValue[0]= '\0';
      }
    }
    portKey = strstr((const char*)payload, PORT_JSON_KEY);
    if (portKey != NULL) { 
      rc = sscanf(portKey, "%*[^:]:%hu[^\",}]", &portValue);
      if (rc == 1) {
        emberAfCorePrintln("Parsed JSON Port: %d", portValue);
      } else {
        emberAfCorePrintln("Failed to read malformed subscriber port (rc=%d)",
                           rc);
        portValue = EMBER_COAP_PORT; 
      }
    }
  }

  if (state == WAIT_FOR_SUBSCRIPTIONS) {
    startReportingTemperature(newSubscriberAddress, portValue);
    responseCode = EMBER_COAP_CODE_204_CHANGED;
  } else {
    responseCode = EMBER_COAP_CODE_503_SERVICE_UNAVAILABLE;
  }

  emberCoapRespondWithCode(info, responseCode);
}

static void startReportingTemperature(const EmberIpv6Address *newSubscriberAddress,
                                      uint16_t newSubscriberPort)
{
  assert(state == WAIT_FOR_SUBSCRIPTIONS);

  MEMCOPY(&subscriberAddress, newSubscriberAddress, sizeof(EmberIpv6Address));
  subscriberPort = newSubscriberPort;
  failedReports = 0;

  emberAfCorePrint("Starting reporting to subscriber at [");
  emberAfCoreDebugExec(emberAfPrintIpv6Address(&subscriberAddress));
  emberAfCorePrintln("]:(%d)",subscriberPort);

  setNextState(REPORT_TEMP_TO_SUBSCRIBER);
}

void ledHandler(EmberCoapCode code,
                uint8_t *uri,
                EmberCoapReadOptions *options,
                const uint8_t *payload,
                uint16_t payloadLength,
                const EmberCoapRequestInfo *info)
{
  emberAfCorePrintln("Toggle LED");
  halToggleLed(BOARD_ACTIVITY_LED);

  emberCoapRespondWithCode(info, EMBER_COAP_CODE_204_CHANGED);
}

void buzzerHandler(EmberCoapCode code,
                   uint8_t *uri,
                   EmberCoapReadOptions *options,
                   const uint8_t *payload,
                   uint16_t payloadLength,
                   const EmberCoapRequestInfo *info)
{
#if defined(CORTEXM3_EFM32_MICRO)
  emberAfCorePrintln("WARN: Received buzzer command, no buzzer HW supported");
  emberCoapRespondWithCode(info, EMBER_COAP_CODE_404_NOT_FOUND);
#else
  emberAfCorePrintln("Sound Buzzer");
  halStackIndicatePresence();
  emberCoapRespondWithCode(info, EMBER_COAP_CODE_204_CHANGED);
#endif
}

void onOffOutHandler(EmberCoapCode code,
                     uint8_t *uri,
                     EmberCoapReadOptions *options,
                     const uint8_t *payload,
                     uint16_t payloadLength,
                     const EmberCoapRequestInfo *info)
{
  emberAfCorePrintln("Toggling Activity LED");

  if (payload == NULL) {
    emberCoapRespondWithCode(info, EMBER_COAP_CODE_400_BAD_REQUEST);
    return;
  } else {
    emberCoapRespondWithCode(info, EMBER_COAP_CODE_204_CHANGED);
  }

  if (payload[0] == '0') {
    halClearLed(BOARD_ACTIVITY_LED);
  } else {
    halSetLed(BOARD_ACTIVITY_LED);
  }
}

