eamars/efr32_bootloader/target/efr32/protocol/thread_2.2/app/thread/sample-app/border-router/sensor-actuator-node/sensor-actuator-node-implementation.c
static void waitForSubscriptions(void)
{
  // Once attached to the border router, we wait for a subscriber to
  // request subcribe to our data. We periodically print a message while
  // waiting to prove we are alive.

  assert(state == WAIT_FOR_SUBSCRIPTIONS);

  emberAfCorePrintln("Waiting for a subscriber");

  repeatStateWithDelay(WAIT_PERIOD_MS);
}

// Helper function used to specify source/destination port
static EmberStatus coapSendUri(EmberCoapCode code,
                               const EmberIpv6Address *destination,
                               const uint16_t destinationPort,
                               const uint16_t sourcePort,
                               const uint8_t *uri,
                               const uint8_t *body,
                               uint16_t bodyLength,
                               EmberCoapResponseHandler responseHandler)
{
  // Use defaults for everything except the ports.
  EmberCoapSendInfo info = {
    .localPort = sourcePort,
    .remotePort = destinationPort,
  };
  return emberCoapSend(destination,
                       code,
                       uri,
                       body,
                       bodyLength,
                       responseHandler,
                       &info);
}

static void reportTemperature(void)
{
  // We periodically send data to the subscriber. The data is the temperature,
  // measured in 10^-3 degrees Celsius.  The success or failure of the reports
  // is tracked so we can determine if the server has disappeared and we should
  // find a new one.

  EmberStatus status;
  int32_t temperatureMC;

#if defined(CORTEXM3_EFM32_MICRO)
  uint32_t tempRead;
#else
  uint16_t value;
  int16_t volts;
#endif

  assert(state == REPORT_TEMP_TO_SUBSCRIBER);

#if defined(CORTEXM3_EFM32_MICRO)
  tempRead = adcRead();
  temperatureMC = convertToCelsius(tempRead);
#else
  halStartAdcConversion(ADC_USER_APP,
                        ADC_REF_INT,
                        TEMP_SENSOR_ADC_CHANNEL,
                        ADC_CONVERSION_TIME_US_256);
  halReadAdcBlocking(ADC_USER_APP, &value);
  volts = halConvertValueToVolts(value / TEMP_SENSOR_SCALE_FACTOR);
  volts = halConvertValueToVolts(value);
  temperatureMC = (1591887L - (171 * (int32_t)volts)) / 10;
#endif
  emberAfCorePrint("Reporting %ld to subscriber at [", temperatureMC);
  emberAfCoreDebugExec(emberAfPrintIpv6Address(&subscriberAddress));
  emberAfCorePrintln("]:(%d)", subscriberPort);

  // Send this CoAP report to the border router when it tries to subscribes:
  // {
  //   "eui64":"1234123412341234",
  //   "temp":"27567"
  // }

  char tempString[25] = {0};

  // NULL JSON that returns the temp and ID of the device
  char jsonString[60] =
    "{\"eui64\":\"0000000000000000\",\"temp\":\"0\"}";

  char tempKey[] = "\",\"temp\":\"";
  char jsonClose[] = "\"}";

  // Put the temp in JSON, for the end of the string
  sprintf(tempString, "%d", temperatureMC);

  uint8_t strSz = strlen("{\"eui64\":\"");
  strncpy(jsonString + strSz, (char const*)euiString, sizeof(jsonString) - strSz);
  strSz += strlen((char const*)euiString);

  // Put the temp in the JSON
  strncpy(jsonString + strSz, (char const*)tempKey, sizeof(jsonString) - strSz);
  strSz += strlen((char const*)tempKey);
  strncpy(jsonString + strSz, (char const*)tempString, sizeof(jsonString) - strSz);
  strSz += strlen((char const*)tempString);

  strncpy(jsonString + strSz, (char const*)jsonClose, sizeof(jsonString) - strSz);
  strSz += strlen((char const*)jsonClose);

  status = coapSendUri(EMBER_COAP_CODE_POST, 
                       &subscriberAddress, 
                       subscriberPort, //dport 
                       EMBER_COAP_PORT, //sport
                       temperatureUri, 
                       (uint8_t const*)jsonString, 
                       strlen(jsonString), 
                       &reportTemperatureStatusHandler);

  if (status == EMBER_SUCCESS) {
    setNextState(WAIT_FOR_DATA_CONFIRMATION);
  } else {
    emberAfCorePrintln("ERR: Reporting failed: 0x%x", status);
    repeatStateWithDelay(REPORT_PERIOD_MS);
  }
}

static void reportTemperatureStatusHandler(EmberCoapStatus status,
                                           EmberCoapCode code,
                                           EmberCoapReadOptions *options,
                                           uint8_t *payload,
                                           uint16_t payloadLength,
                                           EmberCoapResponseInfo *info)
{
  // We track the success or failure of reports so that we can determine when
  // we have lost the subscriber.  A series of consecutive failures is the
  // trigger to detach from the current subscriber and find a new one.  Any
  // successfully-transmitted report clears past failures.

  if (state == WAIT_FOR_DATA_CONFIRMATION) {
    if (status == EMBER_COAP_MESSAGE_ACKED) {
      failedReports = 0;
    } else {
      failedReports++;
      emberAfCorePrintln("ERR: Report timed out - failure %u of %u",
                         failedReports,
                         REPORT_FAILURE_LIMIT);
    }
    if (failedReports < REPORT_FAILURE_LIMIT) {
      setNextStateWithDelay(REPORT_TEMP_TO_SUBSCRIBER, REPORT_PERIOD_MS);
    } else {
      stopReportingTemperature();
    }
  }
}

void netResetHandler(EmberCoapCode code,
                     uint8_t *uri,
                     EmberCoapReadOptions *options,
                     const uint8_t *payload,
                     uint16_t payloadLength,
                     const EmberCoapRequestInfo *info)
{
  emberAfCorePrintln("Performing net reset from CoAP");
  // No CoAP response required, these will be non-confirmable requests
  resetNetworkState();
  rejoinNetwork();
}

void emberButtonPressIsr(uint8_t button, EmberButtonPress press)
{
  // Button 1 - triggers a net reset, then tries to join a network
  // Button 0 - if connected to a subsriber button 0 will send a CoAP request
  // to the subscriber's address

  switch (button) {
  case BUTTON0:
    switch (press) {
    case EMBER_SINGLE_PRESS: {
      emberAfCorePrintln("Button 0 Pressed");
      // Only report a button press if we are reporting to a subscriber
      if (state == REPORT_TEMP_TO_SUBSCRIBER ||
          state == WAIT_FOR_DATA_CONFIRMATION) {
        EmberStatus status;

