eamars/efr32_bootloader/target/efr32/protocol/thread_2.2/app/thread/sample-app/border-router/sensor-actuator-node/sensor-actuator-node-implementation.c
        // Send the attach CoAP response to the border router:
        // {
        //   "eui64":"1234123412341234",
        // }

        // NULL JSON that contains the ID
        char jsonClose[3] = "\"}";
        char jsonString[32] = "{\"eui64\":\"0000000000000000\"}";
        uint8_t strSz = strlen("{\"eui64\":\"");

        strncpy(jsonString + strSz, (char const*)euiString, sizeof(jsonString) - strSz);
        strSz += strlen((char const*)euiString);
        strncpy(jsonString + strSz, (char const*)jsonClose, sizeof(jsonString) - strSz);
        strSz += strlen((char const*)jsonClose);

        emberAfCorePrint("Reporting button press to: [");
        emberAfCoreDebugExec(emberAfPrintIpv6Address(&subscriberAddress));
        emberAfCorePrintln("](%d)", subscriberPort);

        status = coapSendUri(EMBER_COAP_CODE_POST, 
                            &subscriberAddress, 
                            subscriberPort, //dport 
                            EMBER_COAP_PORT, //sport
                            buttonUri,
                            (uint8_t const*)jsonString,
                            strlen(jsonString),
                            &buttonPressStatusHandler);

        if (status != EMBER_SUCCESS) {
          emberAfCorePrintln("ERR: button report failed: 0x%x", status);
        }
      }
    } break;

    case EMBER_DOUBLE_PRESS:
      break;

    default:
      assert(false);
      break;
    }
    break;

  case BUTTON1:
    switch (press) {
    case EMBER_SINGLE_PRESS:
      emberAfCorePrintln("Button 1 Pressed");
      rejoinNetwork();
      break;

    case EMBER_DOUBLE_PRESS:
      break;

    default:
      assert(false);
      break;
    }
    break;

  default:
    assert(false);
    break;
  };
}

// rejoin-network
void rejoinNetworkCommand(void)
{
  rejoinNetwork();
}

static void rejoinNetwork(void)
{
  // This function will attempt to rejoin a network in all cases, if it is
  // already attached to a network it will perform a reset which automatically
  // tries to rejoin
  EmberNetworkStatus networkStatus = emberNetworkStatus();

  emberAfCorePrintln("Rejoin network issued. State: %s NetworkStatus: %s",
                     STATE_STRING(state),
                     NETWORK_STATUS_STRING(networkStatus));

  switch (networkStatus) {
  case EMBER_SAVED_NETWORK:
#if !defined(ENABLE_JOIN_OUT_OF_BAND)
    joinAttemptsRemaining = SENSOR_ACTUATOR_JOIN_ATTEMPTS;
#endif
    setNextState(RESUME_NETWORK);
    break;
  case EMBER_NO_NETWORK:
  case EMBER_JOINED_NETWORK_ATTACHED:
  default:
    // If there is no saved network, then just set the join attempts to the
    // maximum, then reset the network state to try and trigger a join/rejoin
#if !defined(ENABLE_JOIN_OUT_OF_BAND)
    joinAttemptsRemaining = SENSOR_ACTUATOR_JOIN_ATTEMPTS;
#endif
    setNextState(RESET_NETWORK_STATE);
    break;
  }
}
static void buttonPressStatusHandler(EmberCoapStatus status,
                                     EmberCoapCode code,
                                     EmberCoapReadOptions *options,
                                     uint8_t *payload,
                                     uint16_t payloadLength,
                                     EmberCoapResponseInfo *info)
{
  if (status != EMBER_COAP_MESSAGE_ACKED) {
    emberAfCorePrintln("ERR: Button press reporting failed");
  }
}

// stop-report
void stopReportCommand(void)
{
  // If we have a server and are reporting data, we can manually detach and try
  // to find a new server by using a CLI command.

  if (state == REPORT_TEMP_TO_SUBSCRIBER
      || state == WAIT_FOR_DATA_CONFIRMATION) {
    stopReportingTemperature();
  }
}

static void stopReportingTemperature(void)
{
  // We stop reporting temperature in response to failed reports (or a CLI
  // command). Once we detach, we wait for a new subscriber.

  assert(state == REPORT_TEMP_TO_SUBSCRIBER
         || state == WAIT_FOR_DATA_CONFIRMATION);

  emberAfCorePrintln("Stopped reporting to subscriber");

  setNextState(WAIT_FOR_SUBSCRIPTIONS);
}

static void resetNetworkState(void)
{
  emberAfCorePrintln("Resetting network state");
  emberResetNetworkState();
}

void emberResetNetworkStateReturn(EmberStatus status)
{
  // If we ever leave the network, we go right back to joining again.  This
  // could be triggered by an external CLI command.

  if (status == EMBER_SUCCESS) {
    emberAfCorePrintln("Reset network state acknowledged");
    setNextState(JOIN_NETWORK); 
  }
}

void emberUdpHandler(const uint8_t *destination,
                     const uint8_t *source,
                     uint16_t localPort,
                     uint16_t remotePort,
                     const uint8_t *payload,
                     uint16_t payloadLength)
{
  // UDP packets for TFTP bootloading are passed through.  Everything else is
  // simply logged and ignored.

  if (localPort == emTftpLocalTid) {
    emProcessTftpPacket(source, remotePort, payload, payloadLength);
  } else if (localPort == TFTP_BOOTLOADER_PORT) {
    emProcessTftpBootloaderPacket(source, payload, payloadLength);
  } else {
    ALIAS(emberUdpHandler)(destination,
                           source,
                           localPort,
                           remotePort,
                           payload,
                           payloadLength);
  }
}

bool emberVerifyBootloadRequest(const TftpBootloaderBootloadRequest *request)
{
  // A real implementation should verify a bootload request to ensure it is
  // valid.  This sample application simply accepts any request.

  return true;
}

bool emberAfPluginIdleSleepOkToSleepCallback(uint32_t durationMs)
{
  // Once we join to a network, we will automatically stay awake, because we
  // are a router.  Before we join, we would could sleep, but we prevent that
  // by returning false here.

  return false;
}

void stateEventHandler(void)
{
  emberEventControlSetInactive(stateEventControl);

  switch (state) {
  case RESUME_NETWORK:
    resumeNetwork();
    break;
  case JOIN_NETWORK:
    joinNetwork();
    break;
  case WAIT_FOR_JOIN_NETWORK:
    // Wait for joinNetwork to complete
#if defined(ENABLE_JOIN_OUT_OF_BAND)
    joinNetworkCommissionedCompletion();
#endif
    break;
  case WAIT_FOR_SUBSCRIPTIONS:
    waitForSubscriptions();
    break;
  case REPORT_TEMP_TO_SUBSCRIBER:
    reportTemperature();
    break;
  case WAIT_FOR_DATA_CONFIRMATION:
    break;
  case RESET_NETWORK_STATE:
    resetNetworkState();
    break;
  default:
    assert(false);
  }
}

