eamars/efr32_bootloader/target/efr32/protocol/thread_2.2/app/thread/sample-app/border-router/sensor-actuator-node/sensor-actuator-node-implementation.c
static void setNextStateWithDelay(uint8_t nextState, uint32_t delayMs)
{
  state = nextState;
  emberEventControlSetDelayMS(stateEventControl, delayMs);
}

static void formatEuiString(uint8_t* euiString, size_t strSz, const uint8_t* euiBytes)
{
  uint8_t i;
  uint8_t strOffset = 0;
  uint8_t *euiStringEnd = euiString + strSz;

  assert (euiString != NULL);
  assert (strSz > 0);

  // Prints two nybles in hex format into euiString per byte in euiBytes
  for (i = 0; i < EUI64_SIZE && (euiString + strOffset < euiStringEnd); i++) {
    snprintf((char*)(euiString + strOffset),
              strSz,
              "%X%X",
              (euiBytes[7-i]>>4 & 0x0F),
              (euiBytes[7-i] & 0x0F));
    strOffset += 2;
  }
}

static const uint8_t *printableNetworkId(void)
{
  EmberNetworkParameters parameters = {{0}};
  static uint8_t networkId[EMBER_NETWORK_ID_SIZE + 1] = {0};
  emberGetNetworkParameters(&parameters);
  MEMCOPY(networkId, parameters.networkId, EMBER_NETWORK_ID_SIZE);
  return networkId;
}

#if defined(EMBER_AF_PLUGIN_GLIB) && defined(CORTEXM3_EFM32_MICRO)
static char* nodeTypeToString(EmberNodeType nodeType)
{
  static char* returnString[] = { "UNKNOWN_DEVICE ",   // 0
                                  "ERROR          ",   // 1
                                  "ROUTER         ",   // 2
                                  "END_DEVICE     ",   // 3
                                  "SLEEPY_END_DEV ",   // 4
                                  "ERROR          ",   // 5
                                  "ERROR          ",   // 6
                                  "COMMISSIONER   "};  // 7
  switch (nodeType) {
  case EMBER_UNKNOWN_DEVICE:
    return returnString[EMBER_UNKNOWN_DEVICE];
    break;
  case EMBER_ROUTER:
  return returnString[EMBER_ROUTER];
    break;
  case EMBER_END_DEVICE:
    return returnString[EMBER_END_DEVICE];
    break;
  case EMBER_SLEEPY_END_DEVICE:
    return returnString[EMBER_SLEEPY_END_DEVICE];
    break;
  case EMBER_COMMISSIONER:
  return returnString[EMBER_COMMISSIONER];
    break;
  default:
    return returnString[1];
  break;
  }
}
#endif

void updateDisplayEventHandler(void)
{
  emberEventControlSetInactive(updateDisplayEventControl);
#if defined(EMBER_AF_PLUGIN_GLIB) && defined(CORTEXM3_EFM32_MICRO)
  EmberNetworkStatus networkStatus;
  SPIDRV_Init_t initData = SPIDRV_MASTER_USART1;
  SPIDRV_HandleData_t handleData;
  SPIDRV_Handle_t handle = &handleData;

  initData.portLocationTx = PAL_SPI_USART_LOCATION_TX;
  initData.portLocationRx = 0;
  initData.portLocationClk = PAL_SPI_USART_LOCATION_SCLK;
  initData.portLocationCs = 0x00;
  initData.bitRate = PAL_SPI_BAUDRATE;
  initData.bitOrder = spidrvBitOrderLsbFirst;
  initData.csControl = spidrvCsControlApplication;

  SPIDRV_Init(handle, &initData);
  lcdPrintCurrentDeviceState();
  networkStatus = emberNetworkStatus();
  lcdPrintNetworkStatus(networkStatus, 15);
  SPIDRV_DeInit(handle);
  emberEventControlSetDelayMS(updateDisplayEventControl, LCD_REFRESH_MS);
#endif
}

// Utility functions provided to make writing to the LCD on the WSTK easier

#if defined(EMBER_AF_PLUGIN_GLIB) && defined(CORTEXM3_EFM32_MICRO)
void lcdPrintCurrentDeviceState(void)
{
  EmberNetworkStatus networkStatus;
  EmberNetworkParameters parameters = {{0}};
  char tempString[LCD_ASCII_SCREEN_WIDTH + 1] = {0};

  // Clear the screen
  GLIB_clear(&glibContext);

  // Print EUI
  sprintf(tempString, "EUI:%s", euiString);
  GLIB_drawString(&glibContext,
                  tempString,
                  PADDED_ASCII_BUFFER_SIZE,
                  START_COLUMN,
                  EUI_ROW,
                  LCD_OPAQUE_VALUE);

  // Print the join key
  lcdPrintJoinCode(joinKey, JOIN_KEY_ROW);

  // Print network status
  networkStatus = emberNetworkStatus();
  emberEventControlSetActive(updateDisplayEventControl);

  // If we are on a network, we can print other network parameters
  if (networkStatus != EMBER_NO_NETWORK) {
    uint8_t i;

    // Get network parameters
    emberGetNetworkParameters(&parameters);

    // Print Node Type
    sprintf(tempString, "Type: %s", nodeTypeToString(parameters.nodeType));
    GLIB_drawString(&glibContext,
                    tempString,
                    PADDED_ASCII_BUFFER_SIZE,
                    START_COLUMN,
                    NODE_TYPE_ROW,
                    LCD_OPAQUE_VALUE);

    // Print network ID
    MEMCOPY(tempString, parameters.networkId, EMBER_NETWORK_ID_SIZE);
    GLIB_drawString(&glibContext,
                    tempString,
                    PADDED_ASCII_BUFFER_SIZE,
                    START_COLUMN,
                    NETWORK_ID_ROW,
                    LCD_OPAQUE_VALUE);

    // Print the PAN ID
    sprintf(tempString,
        "Pan:%x%x%x%x%x%x%x%x",
        parameters.extendedPanId[7],
        parameters.extendedPanId[6],
        parameters.extendedPanId[5],
        parameters.extendedPanId[4],
        parameters.extendedPanId[3],
        parameters.extendedPanId[2],
        parameters.extendedPanId[1],
        parameters.extendedPanId[0]);

    GLIB_drawString(&glibContext,
                    tempString,
                    PADDED_ASCII_BUFFER_SIZE,
                    START_COLUMN,
                    PAN_ID_ROW,
                    LCD_OPAQUE_VALUE);

    // Print channel
    sprintf(tempString, "Channel: %d", parameters.channel);
    GLIB_drawString(&glibContext,
                    tempString,
                    PADDED_ASCII_BUFFER_SIZE,
                    START_COLUMN,
                    CHANNEL_ROW,
                    LCD_OPAQUE_VALUE);

    // Print IP addresses
    for (i = 0; i < EMBER_MAX_IPV6_ADDRESS_COUNT; i++) {
      EmberIpv6Address address;
      if (emberGetLocalIpAddress(i, &address)) {
        lcdPrintIpv6Address(&address,
                            IP_ADDRESS_INITIAL_ROW + ROW_SIZE * i,
                            LCD_ASCII_SCREEN_WIDTH);
      }
    }
  }
  DMD_updateDisplay();
}

void lcdPrintJoinCode(uint8_t *joinKey, uint8_t printRow)
{
// Don't show the join code if we are using out-of-band joining
#if !defined(ENABLE_JOIN_OUT_OF_BAND)
  char strJoinKey[LCD_ASCII_SCREEN_WIDTH + 1] = {0};
  sprintf(strJoinKey, "Join Phrase:%s", joinKey);
  GLIB_drawString(&glibContext,
                  strJoinKey,
                  PADDED_ASCII_BUFFER_SIZE,
                  START_COLUMN,
                  printRow,
                  LCD_OPAQUE_VALUE);
#endif
}

void lcdPrintNetworkStatus(EmberNetworkStatus status, uint8_t printRow)
{
  switch (status) {
  case EMBER_NO_NETWORK:
    GLIB_drawString(&glibContext,
                    "NS: NO_NETWORK",
                    PADDED_ASCII_BUFFER_SIZE,
                    START_COLUMN,
                    printRow,
                    LCD_OPAQUE_VALUE);
    break;
  case EMBER_SAVED_NETWORK:
    GLIB_drawString(&glibContext,
                    "NS: SAVED_NETWORK",
                    PADDED_ASCII_BUFFER_SIZE,
                    START_COLUMN,
                    printRow,
                    LCD_OPAQUE_VALUE);
    break;
  case EMBER_JOINING_NETWORK:
    GLIB_drawString(&glibContext, 
                    "NS: JOINING_NETWORK",
                    PADDED_ASCII_BUFFER_SIZE,
                    START_COLUMN,
                    printRow,
                    LCD_OPAQUE_VALUE);
    break;
  case EMBER_JOINED_NETWORK_ATTACHING:
    GLIB_drawString(&glibContext,
                    "NS: JOINED_ATTACHING",
                    PADDED_ASCII_BUFFER_SIZE,
                    START_COLUMN,
                    printRow,
                    LCD_OPAQUE_VALUE);
    break;
  case EMBER_JOINED_NETWORK_ATTACHED:
    GLIB_drawString(&glibContext,
                    "NS: JOINED_ATTACHED",
                    PADDED_ASCII_BUFFER_SIZE,
                    START_COLUMN,
                    printRow,
                    LCD_OPAQUE_VALUE);
    break;
  case EMBER_JOINED_NETWORK_NO_PARENT:
    GLIB_drawString(&glibContext,
                    "NS: JOINED_NO_PARENT",
                    PADDED_ASCII_BUFFER_SIZE,
                    START_COLUMN,
                    printRow,
                    LCD_OPAQUE_VALUE);
    break;
  default:
    //PRINT ERROR
    break;
  }
}

void lcdPrintIpv6Address(const EmberIpv6Address *address,
                         uint8_t printRow,
                         uint8_t screenWidth)
{
  uint8_t addrString[EMBER_IPV6_ADDRESS_STRING_SIZE] = {0};
  char shortAddrString[LCD_ASCII_SCREEN_WIDTH + 1] = "....................";
  uint8_t i;
  uint8_t addrLen;

  emberIpv6AddressToString(address, addrString, sizeof(addrString));
  addrLen = strlen((char const*)addrString);

  // The LCD is too short to print the entire address so print the first set of
  // characters
  for (i = 0; i < IP_ADDRESS_CHAR_TRIM; i++) {
    shortAddrString[i] = addrString[i];
  }
  // Then print the last set of characters
  for (i = screenWidth - IP_ADDRESS_CHAR_TRIM; i < screenWidth; i++) {
    shortAddrString[i] = addrString[addrLen - screenWidth + i];
  }
  GLIB_drawString(&glibContext,
                  shortAddrString,
                  PADDED_ASCII_BUFFER_SIZE,
                  START_COLUMN,
                  printRow,
                  LCD_OPAQUE_VALUE);
}
#endif //EMBER_AF_PLUGIN_GLIB
